app/Controllers/LoginController.php

	public function submit_register(){
		$pass = $this->request->getVar('pass');
		$pass_confirm = $this->request->getVar('pass_confirm');
		$data_pass = array();
		$data_pass['hashed_pass'] = password_hash($pass, PASSWORD_DEFAULT);
        $data = [
            'user_name' =>$this->request->getVar('user_name'),
			'pass' =>$data_pass['hashed_pass'],
            'pass_comfirm' =>$this->request->getVar('pass_comfirm'),
            'first_name' =>$this->request->getVar('first_name'),
			'last_name' =>$this->request->getVar('last_name'),
			'company' =>$this->request->getVar('company'),
        ];
		$rules = [
			'user_name' => 'required|is_unique[users.user_name]',
			'pass' => 'required|min_length[70]|max_length[73]',
			'pass_confirm' => 'required',
		];
		if ($this->validate($rules)  && $pass_confirm === $pass) {
			$user = new UserModel();
			$user->insert($data);
---
INSERT INTO `users` (`user_name`, `pass`) VALUES ('neo', '$2y$10$cnTYYzXI4lOwYsgrQm7F6ex/pGxbWObEK0Xd7kdz4hIERTRU3dIF2')